#### Terraform Format and Style 🖌`success`
#### shared-services Terraform Initialization ⚙️`success`
#### shared-services Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### shared-services Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mmodule.key_vault.module.key_vault.random_string.base: Refreshing state... [id=tPY6][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.random_string.base: Refreshing state... [id=Rvwc][0m
[0m[1mmodule.container_registry.module.container_registry.random_string.base: Refreshing state... [id=o5lu][0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.domain_controllers.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.windows_jumpbox.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus][0m
[0m[1mmodule.boot_diag_storage.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus][0m
[0m[1mmodule.container_registry.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-container-registry-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.network_security_group.azurerm_network_security_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services][0m
[0m[1mmodule.domain_controllers.module.managed_disk.azurerm_managed_disk.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.managed_disk.azurerm_managed_disk.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-00-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.public_ip_vgw.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-vgw-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.virtual_network.azurerm_virtual_network.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.public_ip_fw.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-fw-shared-services-eastus][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-shared-services-eastus/providers/Microsoft.Storage/storageAccounts/stdiagshrvwceastus][0m
[0m[1mmodule.domain_controllers.module.network_security_group.azurerm_network_security_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services][0m
[0m[1mmodule.container_registry.module.container_registry.azurerm_container_registry.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-container-registry-shared-services-eastus/providers/Microsoft.ContainerRegistry/registries/acrsho5lueastus][0m
[0m[1mmodule.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services/securityRules/Deny RDP][0m
[0m[1mmodule.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services/securityRules/Allow RDP][0m
[0m[1mmodule.network_transit_hub.module.firewall.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/AzureFirewallSubnet][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[6]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SMB,CIFS,SMB2, DFSN, LSARPC, NbtSS, NetLogonR, SamR, SrvSvc][0m
[0m[1mmodule.network_transit_hub.module.virtual_network_gateway.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/GatewaySubnet][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[2]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP GC][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[15]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SOAP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[9]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, DCOM, EPM, DRSUAPI, NetLogonR, SamR, FRS][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[3]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP GC SSL][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[5]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DNS][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[8]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, EPM][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[14]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DFSN, NetLogon, NetBIOS Datagram Service][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[11]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Windows Time][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[10]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, DFSR (SYSVOL)][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[4]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Kerberos][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP SSL][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[16]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/NetLogon, NetBIOS Name Resolution][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[13]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DCOM, RPC, EPM][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[17]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DFSN, NetBIOS Session Service, NetLogon][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[7]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SMTP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[12]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Kerberos change and set password][0m
[0m[1mmodule.domain_controllers.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.firewall.azurerm_firewall.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/azureFirewalls/azfw-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.virtual_network_gateway.azurerm_virtual_network_gateway.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworkGateways/vgw-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault.azurerm_key_vault.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus/providers/Microsoft.KeyVault/vaults/kvshtpy6eastus][0m
[0m[1mmodule.domain_controllers.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_interface.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_interface.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.network_interface.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-jumpbox-00-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.azurerm_key_vault_access_policy.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus/providers/Microsoft.KeyVault/vaults/kvshtpy6eastus/objectId/e7e9c92f-4927-48e5-9042-263c2e65ba36][0m
[0m[1mmodule.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.virtual_machine.azurerm_windows_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-jumpbox-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-01-shared-services-eastus/dataDisks/datadisk-wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-00-shared-services-eastus/dataDisks/datadisk-wvm-dc-00-shared-services-eastus][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.bastion.module.bastion.azurerm_bastion_host.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_bastion_host" "base" {
      [32m+[0m [0m[1m[0mdns_name[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "bastion-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-bastion-shared-services-eastus"

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                 = "ip-bastion-shared-services-eastus"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
        }
    }

[1m  # module.bastion.module.public_ip.azurerm_public_ip.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "base" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Static"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-bastion-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-bastion-shared-services-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.bastion.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-bastion-shared-services-eastus"
    }

[1m  # module.bastion.module.subnet.azurerm_subnet.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.0.14.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-bastion-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-transit-hub-shared-services-eastus"
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./shared-servicestfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./shared-servicestfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*